package Second_Tusk;    /**  ДОЛЖЕН ОСТАТЬСЯ ОДИН*/

import java.util.Scanner;

public class Main {
    public static void main(String[] args){
        LinkList guys = new LinkList();
        String[] name = {"Алена","Бажена","Белава","Белослава","Блажена","Ванда","Велислава","Вера","Веселина","Ветрана","Власта","Властислава","Ганна","Годислава","Гостимира","Дана","Дарина","Даромила","Душана","Ждана","Крайсава","Купава","Ладомила","Ладомира","Ладослава","Лана","Любомила","Мила","Милава","Милорада","Надежда","Негомила","Неждана","Ожана","Олеся","Олислава","Отрада","Прекраса","Радимила","Радислава","Светлана","Светозара","Светолика","Святава","Тихосава","Томира","Улада","Хранимира","Чаяна"};
        Scanner s = new Scanner(System.in);
        int n=0;

        for(int i=1;i<=20;i++){
            guys.insertFirst(i,name[(int)((Math.random()*(name.length-0))+0)]);
        }

        guys.displayList();

        System.out.println("Введите какого человека необходимо удалять из круга");
        n = s.nextInt();

        guys.delete(n);
        guys.displayList();
    }
}
